In [1]:
import pandas as pd
from openpyxl.workbook import Workbook

In [4]:
df = pd.read_excel('Collections Case Study Data.xlsx', sheet_name=None)

In [6]:
df.keys()

dict_keys(['Loan Details', 'Loan_Status_MartoMay', 'Loan_Status_AprtoJun', 'Historical 6 Months Details', 'Loan_ID mapping', 'Call Details'])

In [17]:
loan_detail = df['Loan Details']
loan_detail.head()

      Loan_id  Debt_to_burden_Ratio  total_income  TENURE  Sanctioned Amount
0  A999993387              0.259113     5326806.0      36           22000000
1  A999990339              0.323385     8392773.0      48           73000000
2  A999971854              0.346267    12000000.0      48           80000000
3  A999952066              0.229800     9000000.0      36           50000000
4  A999938479              0.370082     8500000.0      36           67000000

In [19]:
loan_stat_marmay = df['Loan_Status_MartoMay']
loan_stat_marmay.head()

      Loan_id Bucket  TENURE  ...  Month  Unnamed: 7  Unnamed: 8
0  A999993387    TB0      36  ...  April         NaN         NaN
1  A999993387    TB0      36  ...  March         NaN    576300.0
2  A999990339    TB0      48  ...    May         NaN         NaN
3  A999990339    TB0      48  ...  April         NaN    842600.0
4  A999990339    TB0      48  ...  March         NaN    848000.0

[5 rows x 9 columns]

In [20]:
loan_stat_aprjun = df['Loan_Status_AprtoJun']
loan_stat_aprjun.head()

      Loan_id   Bucket  PRINBALANCE  ...  Month  Unnamed: 7  Unnamed: 8
0  A999993387  REGULAR   12583000.0  ...    May         NaN         NaN
1  A999993387  REGULAR   13192100.0  ...  April         NaN    609100.0
2  A999990339  REGULAR   66303700.0  ...   June         NaN         NaN
3  A999990339  REGULAR   67206100.0  ...    May         NaN         NaN
4  A999990339  REGULAR   68114900.0  ...  April         NaN         NaN

[5 rows x 9 columns]

In [21]:
loan_stat_aprjun = loan_stat_aprjun[['Loan_id', 'Bucket', 'TENURE', 'PRINBALANCE', 'Months on Books', 'Sanctioned Amount', 'Month', 'Unnamed: 7', 'Unnamed: 8']]

In [22]:
loan_stat_aprjun.head()

      Loan_id   Bucket  TENURE  ...  Month  Unnamed: 7  Unnamed: 8
0  A999993387  REGULAR      36  ...    May         NaN         NaN
1  A999993387  REGULAR      36  ...  April         NaN    609100.0
2  A999990339  REGULAR      48  ...   June         NaN         NaN
3  A999990339  REGULAR      48  ...    May         NaN         NaN
4  A999990339  REGULAR      48  ...  April         NaN         NaN

[5 rows x 9 columns]

In [24]:
loan_stat_months = pd.concat([loan_stat_marmay, loan_stat_aprjun])

In [26]:
print(loan_stat_months.head())
print(loan_stat_months.tail())

Loan_id Bucket  TENURE  ...  Month  Unnamed: 7  Unnamed: 8
0  A999993387    TB0      36  ...  April         NaN         NaN
1  A999993387    TB0      36  ...  March         NaN    576300.0
2  A999990339    TB0      48  ...    May         NaN         NaN
3  A999990339    TB0      48  ...  April         NaN    842600.0
4  A999990339    TB0      48  ...  March         NaN    848000.0

[5 rows x 9 columns]
          Loan_id   Bucket  TENURE  ...  Month  Unnamed: 7  Unnamed: 8
80764  A100026967      TB0      48  ...    May         NaN         NaN
80765  A100026967      TB0      48  ...  April         NaN         NaN
80766  A100005454  REGULAR      36  ...   June         NaN         NaN
80767  A100005454  REGULAR      36  ...    May         NaN         NaN
80768  A100005454  REGULAR      36  ...  April         NaN         NaN

[5 rows x 9 columns]

In [27]:
data = pd.merge(loan_detail, loan_stat_months, how='left', on='Loan_id')

In [28]:
data = data.drop(columns=['Unnamed: 7', 'Unnamed: 8'], axis=1)
data.head()

      Loan_id  Debt_to_burden_Ratio  ...  Sanctioned Amount_y  Month
0  A999993387              0.259113  ...             22000000  April
1  A999993387              0.259113  ...             22000000  March
2  A999993387              0.259113  ...             22000000    May
3  A999993387              0.259113  ...             22000000  April
4  A999990339              0.323385  ...             73000000    May

[5 rows x 11 columns]

In [30]:
hist_data = df['Historical 6 Months Details'].head()
hist_data.head()

      Loan_id  paidcure  paiduncure  ...  max6del  max3del  Month
0  A999993387         6           0  ...        0        0  April
1  A999993387         6           0  ...        0        0  March
2  A999990339         6           0  ...        0        0    May
3  A999990339         5           0  ...        0        0  April
4  A999990339         4           0  ...        0        0  March

[5 rows x 13 columns]

In [31]:
data = pd.merge(data, hist_data, how='left', on=['Loan_id', 'Month'])
data.head()

      Loan_id  Debt_to_burden_Ratio  ...  max6del  max3del
0  A999993387              0.259113  ...      0.0      0.0
1  A999993387              0.259113  ...      0.0      0.0
2  A999993387              0.259113  ...      NaN      NaN
3  A999993387              0.259113  ...      0.0      0.0
4  A999990339              0.323385  ...      0.0      0.0

[5 rows x 22 columns]

In [33]:
loan_id_map = df['Loan_ID mapping']
loan_id_map.head()

       Loanid Application_id
0  A999993387    MX-90216316
1  A999990339   MX-459254348
2  A999971854   MX-153697240
3  A999952066   MX-552890335
4  A999938479   MX-962936786

In [34]:
call_details = df['Call Details']
call_details.head()

   month Application_Id  ... Promise_to_pay  total_contacts
0      3   MX-100062359  ...              1               1
1      3   MX-100095892  ...              0               2
2      3   MX-100116696  ...              0               3
3      3    MX-10011780  ...              1              10
4      3   MX-100133826  ...              3              17

[5 rows x 6 columns]

In [40]:
call_details['month'].value_counts()

5    27983
4    26848
3    24783
Name: month, dtype: int64

In [41]:
m = {3:'March', 4:'April', 5:'May'}
call_details['month'] = call_details['month'].map(m)

In [42]:
call_details.head()

   month Application_Id  ... Promise_to_pay  total_contacts
0  March   MX-100062359  ...              1               1
1  March   MX-100095892  ...              0               2
2  March   MX-100116696  ...              0               3
3  March    MX-10011780  ...              1              10
4  March   MX-100133826  ...              3              17

[5 rows x 6 columns]

In [44]:
call_details = pd.merge(loan_id_map, call_details, how='left', left_on='Application_id', right_on='Application_Id')
call_details.head()

       Loanid Application_id  ... Promise_to_pay total_contacts
0  A999993387    MX-90216316  ...            0.0            1.0
1  A999993387    MX-90216316  ...            0.0            6.0
2  A999993387    MX-90216316  ...            0.0            1.0
3  A999990339   MX-459254348  ...            1.0           20.0
4  A999990339   MX-459254348  ...            1.0            4.0

[5 rows x 8 columns]

In [45]:
data = pd.merge(data, call_details, how='left', left_on=['Loan_id', 'Month'], right_on=['Loanid', 'month'])

In [46]:
data.head()

      Loan_id  Debt_to_burden_Ratio  ...  Promise_to_pay  total_contacts
0  A999993387              0.259113  ...             0.0             6.0
1  A999993387              0.259113  ...             0.0             1.0
2  A999993387              0.259113  ...             0.0             1.0
3  A999993387              0.259113  ...             NaN             NaN
4  A999993387              0.259113  ...             0.0             6.0

[5 rows x 30 columns]

In [47]:
writer = pd.ExcelWriter('data.xlsx')
data.to_excel(writer,'Sheet1')
writer.save()

In [48]:
data.head()

      Loan_id  Debt_to_burden_Ratio  ...  Promise_to_pay  total_contacts
0  A999993387              0.259113  ...             0.0             6.0
1  A999993387              0.259113  ...             0.0             1.0
2  A999993387              0.259113  ...             0.0             1.0
3  A999993387              0.259113  ...             NaN             NaN
4  A999993387              0.259113  ...             0.0             6.0

[5 rows x 30 columns]